export const categoryData: {
    [mainCategory: string]: {
        [middleCategory: string]: string[]
    }
} = {
    '01.사업관리': {
        '01.프로젝트관리': ['01.프로젝트관리'],
    },
    '02.경영·회계·사무': {
        '01.기획사무': ['01.경영기획', '02.사업개발', '03.인사기획', '04.경영진지원'],
        '02.홍보·광고': ['01.홍보', '02.광고기획', '03.광고제작'],
        '03.회계': ['01.재무회계', '02.관리회계'],
        '04.총무·인사': ['01.총무', '02.인사관리'],
        '05.사무지원': ['01.사무지원', '02.사무행정'],
    },
    '03.금융·보험': {
        '01.금융': ['01.금융상품영업', '02.금융자산운용'],
        '02.보험': ['01.보험계약관리', '02.보험금심사', '03.보험사기조사'],
    },
    '04.교육·자연·사회과학': {
        '01.교육': ['01.교과교육', '02.직업교육', '03.평생교육'],
        '02.자연과학': ['01.수학', '02.물리', '03.화학', '04.생명과학'],
        '03.사회과학': ['01.정치외교', '02.사회복지', '03.심리학'],
    },
    '05.법률·경찰·소방·교도·국방': {
        '01.법률': ['01.법률지원'],
        '02.경찰': ['01.경찰행정'],
        '03.소방': ['01.화재진압', '02.구조구급'],
        '04.교도': ['01.수형자관리'],
        '05.국방': ['01.작전기획', '02.무기운용'],
    },
    '06.보건·의료': {
        '01.보건': ['01.보건관리', '02.환경보건', '03.산업위생'],
        '02.의료': ['01.의사', '02.간호', '03.방사선', '04.물리치료'],
    },
    '07.사회복지·종교': {
        '01.사회복지': ['01.사회복지상담', '02.사회복지실천', '03.사회복지행정'],
        '02.종교': ['01.종교일반'],
    },
    '08.문화·예술·디자인·방송': {
        '01.문화예술': ['01.공연예술', '02.시각예술'],
        '02.디자인': ['01.시각디자인', '02.제품디자인', '03.패션디자인'],
        '03.방송': ['01.영상제작', '02.음향조정'],
    },
    '09.스포츠': {
        '01.스포츠경기': ['01.경기지도'],
        '02.스포츠관리': ['01.경기운영', '02.체육시설관리'],
    },
    '10.영업판매': {
        '01.영업관리': ['01.영업기획', '02.영업관리'],
        '02.판매': ['01.매장판매', '02.모바일판매'],
        '03.물류유통': ['01.창고관리', '02.물류운송'],
    },
    '11.경비·청소': {
        '01.경비': ['01.시설경비', '02.보안'],
        '02.청소': ['01.환경미화'],
    },
    '12.이용·숙박·여행·오락·스포츠': {
        '01.이용': ['01.이용서비스'],
        '02.숙박': ['01.숙박서비스'],
        '03.여행': ['01.여행기획'],
        '04.오락·스포츠': ['01.오락운영', '02.스포츠강습'],
    },
    '13.음식서비스': {
        '01.조리': ['01.한식조리', '02.양식조리', '03.중식조리', '04.일식조리', '05.제과제빵'],
        '02.음료': ['01.커피바리스타', '02.소믈리에'],
    },
    '14.건설': {
        '01.건축': ['01.건축설계', '02.건축시공', '03.건축감리'],
        '02.토목': ['01.토목설계', '02.토목시공'],
        '03.설비': ['01.기계설비', '02.전기설비'],
    },
    '15.기계': {
        '01.기계설계': ['01.설계기획', '02.기계설계'],
        '02.기계가공': ['01.절삭가공', '02.특수가공'],
        '03.기계조립·관리': ['01.기계조립', '02.기계생산관리'],
        '04.기계품질관리': ['01.기계품질관리'],
        '05.기계장치설치': ['01.기계장비설치·정비', '02.냉동공조설비', '03.이륜차정비'],
        '06.자동차': ['01.자동차설계', '02.자동차제작', '03.자동차정비', '04.자동차정비관리', '05.자동차관리'],
        '07.철도차량제작': ['01.철도차량설계·제작', '02.철도차량유지보수'],
        '08.조선': ['01.선박설계', '02.선체건조', '03.선박의장생산', '04.선박품질관리', '05.선박생산관리', '06.시운전', '07.선박정비', '08.레저선박'],
        '09.항공기제작': ['01.항공기설계', '02.항공기제작', '03.항공기정비', '04.항공장비관리'],
        '10.금형': ['00.금형(공통)', '01.사출금형', '02.프레스금형', '03.다이캐스팅금형'],
        '11.스마트공장(smart factory)': ['01.스마트공장(smart factory)설계', '02.스마트공장(smart factory)설치', '03.스마트공장(smart factory)운영관리'],
    },
    '16.재료': {
        '01.금속재료': ['01.금속엔지니어링', '02.금속재료제조', '03.금속가공', '04.표면처리', '05.용접', '06.비철금속재료제조'],
        '02.세라믹재료': ['00.세라믹재료공통', '03.소성·소결세라믹제조', '04.용융세라믹제조', '05.탄소재료제조'],
    },
    '17.화학·바이오': {
        '01.화학·바이오공통': ['01.화학물질·품질관리', '02.화학공정관리', '03.화학제품연구개발'],
        '02.석유·기초화학물': ['00.석유화학공통', '01.석유·천연가스', '02.기초유기화학물', '03.기초무기화학물'],
        '03.정밀화학': ['00.정밀화학(공통)', '01.비료·농약', '02.기능성정밀화학', '05.수소연료전지', '06.의약품', '07.화장품'],
        '04.플라스틱·고무': ['01.플라스틱', '02.고무'],
        '05.바이오': ['01.바이오의약', '02.바이오에너지', '03.생명공학'],
    },
    '18.섬유·의복': {
        '01.섬유제조': ['01.섬유생산', '02.섬유가공', '03.섬유생산관리'],
        '02.패션': ['01.패션제품기획', '02.패션제품생산', '03.패션제품유통', '04.신발개발·생산'],
        '03.의복관리': ['01.세탁·수선'],
    },
    '19.전기·전자': {
        '01.전기': [
            '01.발전설비설계', '02.발전설비운영', '03.송배전설비', '04.지능형전력망설비',
            '05.전기기기제작', '06.전기설비설계·감리', '07.전기공사', '08.전기자동제어',
            '09.전기철도', '10.철도신호제어', '11.초임계CO₂발전', '12.전기저장장치',
            '13.미래형전기시스템', '14.전지'
        ],
        '02.전자기기일반': ['01.전자제품개발기획·생산', '02.전자부품기획·생산', '03.전자제품고객지원'],
        '03.전자기기개발': [
            '01.가전기기개발', '02.산업용전자기기개발', '03.정보통신기기개발', '04.전자응용기기개발',
            '05.전자부품개발', '06.반도체개발', '07.디스플레이개발', '08.로봇개발',
            '09.의료장비제조', '10.광기술개발', '11.3D프린터개발', '12.가상훈련시스템개발',
            '13.착용형스마트기기', '14.플렉시블디스플레이개발', '15.스마트팜개발', '16.OLED개발',
            '17.커넥티드카개발', '18.자율주행개발', '19.원격시스템개발', '20.전자기기개발'
        ]
    },
    '20.정보통신': {
        '01.정보기술': [
            '01.정보기술전략·계획',
            '02.정보기술개발',
            '03.정보기술운영',
            '04.정보기술관리',
            '05.정보기술영업',
            '06.정보보호',
            '07.인공지능',
            '08.블록체인',
            '09.스마트물류',
            '10.디지털트윈',
            '11.개인정보보호',
        ],
        '02.통신기술': [
            '01.유선통신구축',
            '02.무선통신구축',
            '03.통신서비스',
            '04.실감형콘텐츠제작',
        ],
        '03.방송기술': [
            '01.방송제작기술',
            '02.방송플랫폼기술',
            '03.방송서비스',
        ],
    },
    '21.식품가공': {
        '01.식품가공': [
            '01.식품가공',
            '02.식품저장',
            '03.식품유통',
        ],
        '02.제과·제빵·떡제조': [
            '01.제과·제빵·떡제조',
        ],
    },
    '22.인쇄·목재·가구·공예': {
        '01.인쇄·출판': [
            '01.출판',
            '02.인쇄',
        ],
        '02.공예': [
            '01.공예',
            '02.귀금속·보석',
        ],
    },
    '23.환경·에너지·안전': {
        '01.산업환경': [
            '01.수질관리',
            '02.대기관리',
            '03.폐기물관리',
            '04.소음진동관리',
            '05.토양·지하수관리',
        ],
        '02.환경보건': [
            '01.환경보건관리',
        ],
        '03.자연환경': [
            '01.생태복원·관리',
        ],  
        '04.환경서비스': [
            '01.환경경영',
            '02.환경평가',
        ],
        '05.에너지·자원': [
            '01.광산조사·탐사',
            '02.광물·석유자원개발·생산',
            '03.광산환경관리',
            '04.광산보안',
            '05.재생에너지',
            '06.에너지관리',
            '07.신에너지',
        ],
        '06.산업안전보건': [
            '01.산업안전관리',
            '02.산업보건관리',
            '03.비파괴검사',
        ],
    },
    '24.농림어업': {
        '01.농업': ['01.작물재배', '02.종자생산·유통', '03.농촌개발', '04.화훼장식'],
        '02.축산': ['01.축산자원개발', '02.사육관리'],
        '03.임업': ['01.산림자원조성', '02.산림관리', '03.임산물생산·가공'],
        '04.수산': ['01.어업', '02.양식', '03.수산자원관리', '04.어촌개발'],
    },
};
