export const categoryData: {
    [mainCategory: string]: {
        [middleCategory: string]: string[]
    }
} = {
    '사업관리': {
        '프로젝트관리': ['프로젝트관리'],
    },
    '경영·회계·사무': {
        '기획사무': ['경영기획', '사업개발', '인사기획', '경영진지원'],
        '홍보·광고': ['홍보', '광고기획', '광고제작'],
        '회계': ['재무회계', '관리회계'],
        '총무·인사': ['총무', '인사관리'],
        '사무지원': ['사무지원', '사무행정'],
    },
    '금융·보험': {
        '금융': ['금융상품영업', '금융자산운용'],
        '보험': ['보험계약관리', '보험금심사', '보험사기조사'],
    },
    '교육·자연·사회과학': {
        '교육': ['교과교육', '직업교육', '평생교육'],
        '자연과학': ['수학', '물리', '화학', '생명과학'],
        '사회과학': ['정치외교', '사회복지', '심리학'],
    },
    '법률·경찰·소방·교도·국방': {
        '법률': ['법률지원'],
        '경찰': ['경찰행정'],
        '소방': ['화재진압', '구조구급'],
        '교도': ['수형자관리'],
        '국방': ['작전기획', '무기운용'],
    },
    '보건·의료': {
        '보건': ['보건관리', '환경보건', '산업위생'],
        '의료': ['의사', '간호', '방사선', '물리치료'],
    },
    '사회복지·종교': {
        '사회복지': ['사회복지상담', '사회복지실천', '사회복지행정'],
        '종교': ['종교일반'],
    },
    '문화·예술·디자인·방송': {
        '문화예술': ['공연예술', '시각예술'],
        '디자인': ['시각디자인', '제품디자인', '패션디자인'],
        '방송': ['영상제작', '음향조정'],
    },
    '스포츠': {
        '스포츠경기': ['경기지도'],
        '스포츠관리': ['경기운영', '체육시설관리'],
    },
    '영업판매': {
        '영업관리': ['영업기획', '영업관리'],
        '판매': ['매장판매', '모바일판매'],
        '물류유통': ['창고관리', '물류운송'],
    },
    '경비·청소': {
        '경비': ['시설경비', '보안'],
        '청소': ['환경미화'],
    },
    '이용·숙박·여행·오락·스포츠': {
        '이용': ['이용서비스'],
        '숙박': ['숙박서비스'],
        '여행': ['여행기획'],
        '오락·스포츠': ['오락운영', '스포츠강습'],
    },
    '음식서비스': {
        '조리': ['한식조리', '양식조리', '중식조리', '일식조리', '제과제빵'],
        '음료': ['커피바리스타', '소믈리에'],
    },
    '건설': {
        '건축': ['건축설계', '건축시공', '건축감리'],
        '토목': ['토목설계', '토목시공'],
        '설비': ['기계설비', '전기설비'],
    },
    '기계': {
        '기계설계': ['설계기획', '기계설계'],
        '기계가공': ['절삭가공', '특수가공'],
        '기계조립·관리': ['기계조립', '기계생산관리'],
        '기계품질관리': ['기계품질관리'],
        '기계장치설치': ['기계장비설치·정비', '냉동공조설비', '이륜차정비'],
        '자동차': ['자동차설계', '자동차제작', '자동차정비', '자동차정비관리', '자동차관리'],
        '철도차량제작': ['철도차량설계·제작', '철도차량유지보수'],
        '조선': ['선박설계', '선체건조', '선박의장생산', '선박품질관리', '선박생산관리', '시운전', '선박정비', '레저선박'],
        '항공기제작': ['항공기설계', '항공기제작', '항공기정비', '항공장비관리'],
        '금형': ['00.금형(공통)', '사출금형', '프레스금형', '다이캐스팅금형'],
        '스마트공장(smart factory)': ['스마트공장(smart factory)설계', '스마트공장(smart factory)설치', '스마트공장(smart factory)운영관리'],
    },
    '재료': {
        '금속재료': ['금속엔지니어링', '금속재료제조', '금속가공', '표면처리', '용접', '비철금속재료제조'],
        '세라믹재료': ['00.세라믹재료공통', '소성·소결세라믹제조', '용융세라믹제조', '탄소재료제조'],
    },
    '화학·바이오': {
        '화학·바이오공통': ['화학물질·품질관리', '화학공정관리', '화학제품연구개발'],
        '석유·기초화학물': ['00.석유화학공통', '석유·천연가스', '기초유기화학물', '기초무기화학물'],
        '정밀화학': ['00.정밀화학(공통)', '비료·농약', '기능성정밀화학', '수소연료전지', '의약품', '화장품'],
        '플라스틱·고무': ['플라스틱', '고무'],
        '바이오': ['바이오의약', '바이오에너지', '생명공학'],
    },
    '섬유·의복': {
        '섬유제조': ['섬유생산', '섬유가공', '섬유생산관리'],
        '패션': ['패션제품기획', '패션제품생산', '패션제품유통', '신발개발·생산'],
        '의복관리': ['세탁·수선'],
    },
    '전기·전자': {
        '전기': [
            '발전설비설계', '발전설비운영', '송배전설비', '지능형전력망설비',
            '전기기기제작', '전기설비설계·감리', '전기공사', '전기자동제어',
            '전기철도', '철도신호제어', '초임계CO₂발전', '전기저장장치',
            '미래형전기시스템', '전지'
        ],
        '전자기기일반': ['전자제품개발기획·생산', '전자부품기획·생산', '전자제품고객지원'],
        '전자기기개발': [
            '가전기기개발', '산업용전자기기개발', '정보통신기기개발', '전자응용기기개발',
            '전자부품개발', '반도체개발', '디스플레이개발', '로봇개발',
            '의료장비제조', '광기술개발', '3D프린터개발', '가상훈련시스템개발',
            '착용형스마트기기', '플렉시블디스플레이개발', '스마트팜개발', 'OLED개발',
            '커넥티드카개발', '자율주행개발', '원격시스템개발', '전자기기개발'
        ]
    },
    '정보통신': {
        '정보기술': [
            '정보기술전략·계획',
            '정보기술개발',
            '정보기술운영',
            '정보기술관리',
            '정보기술영업',
            '정보보호',
            '인공지능',
            '블록체인',
            '스마트물류',
            '디지털트윈',
            '개인정보보호',
        ],
        '통신기술': [
            '유선통신구축',
            '무선통신구축',
            '통신서비스',
            '실감형콘텐츠제작',
        ],
        '방송기술': [
            '방송제작기술',
            '방송플랫폼기술',
            '방송서비스',
        ],
    },
    '식품가공': {
        '식품가공': [
            '식품가공',
            '식품저장',
            '식품유통',
        ],
        '제과·제빵·떡제조': [
            '제과·제빵·떡제조',
        ],
    },
    '인쇄·목재·가구·공예': {
        '인쇄·출판': [
            '출판',
            '인쇄',
        ],
        '공예': [
            '공예',
            '귀금속·보석',
        ],
    },
    '환경·에너지·안전': {
        '산업환경': [
            '수질관리',
            '대기관리',
            '폐기물관리',
            '소음진동관리',
            '토양·지하수관리',
        ],
        '환경보건': [
            '환경보건관리',
        ],
        '자연환경': [
            '생태복원·관리',
        ],  
        '환경서비스': [
            '환경경영',
            '환경평가',
        ],
        '에너지·자원': [
            '광산조사·탐사',
            '광물·석유자원개발·생산',
            '광산환경관리',
            '광산보안',
            '재생에너지',
            '에너지관리',
            '신에너지',
        ],
        '산업안전보건': [
            '산업안전관리',
            '산업보건관리',
            '비파괴검사',
        ],
    },
    '농림어업': {
        '농업': ['작물재배', '종자생산·유통', '농촌개발', '화훼장식'],
        '축산': ['축산자원개발', '사육관리'],
        '임업': ['산림자원조성', '산림관리', '임산물생산·가공'],
        '수산': ['어업', '양식', '수산자원관리', '어촌개발'],
    },
};
